Taxi/test_execute_doc/billing_wallet/topup_with_payload_expected.json

{
  "accounts": [],
  "doc_update_request": {
    "data": {
      "status_info": {
        "status": "success"
      }
    },
    "doc_id": 6,
    "idempotency_key": "finalize",
    "status": "complete"
  },
  "docs": [
    {
      "docs": [
        {
          "data": {
            "transaction_id": "6"
          },
          "event_at": "2018-05-09T20:00:00.000000+00:00",
          "external_ref": "external_ref/1",
          "journal_entries": [
            {
              "account_id": 42,
              "amount": "99",
              "details": {
                "order_id": "<order_id>",
                "payload": {
                  "answer_to_the_ultimate_question_of_life": "42",
                  "payload": {
                    "alias_id": "<alias_id>",
                    "field_with_null": null,
                    "oebs_mvp_id": "MSKc",
                    "order_id": "<order_id>",
                    "tariff_class": "econom"
                  }
                },
                "service": "6",
                "service_name": "eda",
                "tlog_amount": "99",
                "transaction_id": "6",
                "transaction_type": "payment"
              },
              "event_at": "2018-05-09T20:00:00.000000+00:00"
            },
            {
              "account_id": 43,
              "amount": "99",
              "details": {
                "order_id": "<order_id>",
                "payload": {
                  "answer_to_the_ultimate_question_of_life": "42",
                  "payload": {
                    "alias_id": "<alias_id>",
                    "field_with_null": null,
                    "oebs_mvp_id": "MSKc",
                    "order_id": "<order_id>",
                    "tariff_class": "econom"
                  }
                },
                "service": "6",
                "service_name": "eda",
                "tlog_amount": "99",
                "transaction_id": "6",
                "transaction_type": "payment"
              },
              "event_at": "2018-05-09T20:00:00.000000+00:00"
            }
          ],
          "kind": "billing_wallet_top_up",
          "service": "billing-calculators",
          "tags": [
            "w/oid/6"
          ],
          "topic": "billing_wallet_top_up/<yandex_uid>/handled"
        }
      ]
    }
  ],
  "entities": [],
  "payouts": [
    {
      "data": {
        "base_doc_id": 6,
        "event_version": 1,
        "payments": [
          {
            "amount": "99",
            "currency": "RUB",
            "invoice_date": "2018-05-09T20:00:00.000000+00:00",
            "payload": {
              "order_id": "<order_id>",
              "payload": {
                "alias_id": "<alias_id>",
                "oebs_mvp_id": "MSKc",
                "order_id": "<order_id>",
                "tariff_class": "econom"
              },
              "service": "6",
              "transaction_id": "6",
              "transaction_type": "payment",
              "wallet_id": "<wallet_id>"
            },
            "payment_kind": "top_up"
          }
        ],
        "schema_version": "v1",
        "topic_begin_at": "2018-05-07T20:00:00.000000+00:00"
      },
      "event_at": "2018-05-09T20:00:00.000000+00:00",
      "external_ref": "6",
      "kind": "cashback",
      "topic": "cashback/6"
    }
  ],
  "stq_calls": [
    {
      "eta": null,
      "kwargs": {
        "wallet_id": "<wallet_id>",
        "yandex_uid": "<yandex_uid>"
      },
      "queue": "billing_wallet_balance_notify",
      "task_id": "transaction_id/6"
    }
  ]
}
